app/controllers/pelis_controller.rb

SELECT "pelis".* FROM "pelis"
---
  def index
    @pelis = Peli.all

INSERT INTO "pelis" ("nombre", "genero", "imagen", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "Back to The Future"], ["genero", "Ciencia Ficcion"], ["imagen", "error.jpg"], ["created_at", "2018-03-17 14:42:02.122434"], ["updated_at", "2018-03-17 14:42:02.122434"]]
---
  def create
    @peli = Peli.new(peli_params)

    respond_to do |format|
      if @peli.save

UPDATE "pelis" SET "nombre" = ?, "imagen" = ?, "updated_at" = ? WHERE "pelis"."id" = ?  [["nombre", "Inside Down"], ["imagen", "inside_out-161470323-mmed.jpg"], ["updated_at", "2018-03-17 14:56:07.853867"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @peli.update(peli_params)

SELECT  "pelis".* FROM "pelis" WHERE "pelis"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_peli
      @peli = Peli.find(params[:id])