app/controllers/usuarios_controller.rb

INSERT INTO "usuarios" ("nombre", "email", "tipo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "ivanayael"], ["email", "ivanayael@hotmail.com"], ["tipo", "admin"], ["created_at", "2018-03-17 15:39:14.439333"], ["updated_at", "2018-03-17 15:39:14.439333"]]
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save